Classes in data: ['alpha', 'beta', 'pi', 'phi', 'gamma', 'sum', 'v', 'p', 'theta', 'times']
Model: SequentialTrain-to-Holdout Ratio: 0.9
Holdout Accuracy: 0.9815891472868217
Model.History:
loss: [1.2992671067769739, 0.2585443485216713, 0.10129883594277059]
accuracy: [0.556167, 0.92194045, 0.968836]
categorical_accuracy: [0.556167, 0.92194045, 0.968836]
precision: [0.8668624, 0.94469416, 0.9746675]
recall: [0.40620887, 0.9052518, 0.96428996]
val_loss: [0.4384905570482412, 0.16257811907931471, 0.0726874839791184]
val_accuracy: [0.87190527, 0.959634, 0.98493004]
val_categorical_accuracy: [0.87190527, 0.959634, 0.98493004]
val_precision: [0.9127672, 0.96854305, 0.987013]
val_recall: [0.8503767, 0.94456404, 0.9817008]
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 43, 43, 45)        450       
_________________________________________________________________
activation (Activation)      (None, 43, 43, 45)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 41, 41, 50)        20300     
_________________________________________________________________
activation_1 (Activation)    (None, 41, 41, 50)        0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 20, 20, 50)        0         
_________________________________________________________________
dropout (Dropout)            (None, 20, 20, 50)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 18, 18, 50)        22550     
_________________________________________________________________
activation_2 (Activation)    (None, 18, 18, 50)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 9, 9, 50)          0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 9, 9, 50)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 7, 7, 50)          22550     
_________________________________________________________________
activation_3 (Activation)    (None, 7, 7, 50)          0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 7, 7, 50)          0         
_________________________________________________________________
flatten (Flatten)            (None, 2450)              0         
_________________________________________________________________
dense (Dense)                (None, 20)                49020     
_________________________________________________________________
dense_1 (Dense)              (None, 10)                210       
_________________________________________________________________
activation_4 (Activation)    (None, 10)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 10)                110       
_________________________________________________________________
activation_5 (Activation)    (None, 10)                0         
=================================================================
Total params: 115,190
Trainable params: 115,190
Non-trainable params: 0
_________________________________________________________________
Model.to_json
<bound method Network.to_json of <tensorflow.python.keras.engine.sequential.Sequential object at 0x1a3fbda1d0>>